{"features.forecast.tomorrow":"header for the tomorrow forecast. ex: Tomorrow","menu.newlocation":"link to add a new location from context menu","features.maxuv":"label that refers to the maximum ultraviolet radiation for a day. (e.g., the intensity of the sun)","options.radar.height":"label for custom radar image height textbox (px are pixels)","options.radar.url":"label for custom radar image URL textbox","options.toolbar.header":"header for section of options that asks what should be displayed in the toolbar","options.units.multiselect":"instructions on how to select multiple units when in Custom unit mode","options.radar.small":"label for option to display small radar image","days.sun":"An abbreviation for Sunday. Please use the full name if its short.","features.hourlyclick":"tooltip for link to hourly forecast.","options.units.visibility.header":"header for visibility unit","options.positions.instructions":"instructional label for how to move forecastfox between toolbars using drag and drop. this appears in the customization window","data.moon_phases.first_quarter":"A phase of the moon","features.day5click":"the tooltip for link to 5-day forecast","features.close":"label for link that closes a popup window","copyright":"copyright notice","options.search.instructions":"instructions for the location search box","options.toolbar.image":"label for option to display only the image in toolbar","options.units.temp.f":"temperature option Fahrenheit (°F)","features.sunset":"label that refers to a day's sunset time","options.units.temp.c":"temperature option Celsius (°C)","converters.speed.mph":"how to display miles per hour","options.theme.icons":"the header for the icons section of the options page. the icons section lets you switch between icon / image packs","options.units.wind.ms":"wind speed option. meters per second (ms)","features.forecast.today":"header for the today forecast. ex: Today","options.previous":"header for the list of previous locations in options page","options.toolbar.labelslength":"label for option asking how many icons should have the text labels for. e.g., if you select 2, then the current conditions and the today forecast would have text labels, while the rest would just be icons","features.cc.header":"Refers to \"now\" in the sense of time. This is used when referring to the current conditions.","data.moon_phases.full":"A phase of the moon","features.dragdrop.tooltip":"tooltip for the button you use to drag and drop forecastfox. drag and drop lets you move Forecastfox to another toolbar or position","options.instructions.bottom":"instructional message that appears at the bottom of the customization page","options.units.wind.bft":"wind speed option for beaufort scale (bft) -- http://en.wikipedia.org/wiki/Beaufort_scale -- probably don't need to translate this","notification.button.label":"label for the button to have NoScript grant access to the page","options.data.header":"header for section of options asking what optional weather data should be displayed in the forecast details sections","menu.troubleshooting":"link to a troubleshooting page in Firefox context menu","options.data.wind":"label for option to display wind","options.units.time.header":"header for time formats","features.animated":"name of the link that goes to an animated radar page (one that moves)","data.moon_phases.new":"A phase of the moon (new moon). You can refer to this diagram for what the moon phases refer to: http://www4.nau.edu/meteorite/Meteorite/Images/Moon_Phase.jpg","name":"Name of extension. Leave as is for now.","converters.pressure.hpa":"pressure in hectopascals (hPa) 1hpa == 1mbar","converters.coordinate":"how to format a longitude / latitude coordinate","converters.distance.lng.km":"distance in kilometers","options.units.precip.cm":"precipitation / distance option.centimeters (cm)","converters.percent":"how to format a percentage: ex 90%","options.restore.message":"description of the \"restore defaults\" button","options.current":"this is in the options page to let people know what the current location is","converters.pressure.mb":"pressure in milibars","options.units.pressure.mmhg":"option for pressure (milimeters of mercury)","converters.speed.knots":"how to display knots (nautical miles per hour)","converters.speed.bft":"beaufort scale -- http://en.wikipedia.org/wiki/Beaufort_scale -- probably don't need to translate this","options.locations.tryagain":"the label for link that appears when there is an error looking up the location on AccuWeather. it attempts the search again","options.units.pressure.inhg":"option for pressure (inches of mercury)","options.units.visibility.nm":"visibility / distance option in nautical miles (Nm)","options.units.visibility.mi":"visibility / distance option. miles (mi)","options.units.american":"label for English / American units. (°F, mph, mi)","options.data.air":"label for option to display air quality","options.toolbar.separators":"label for option that asks if the separators between the toolbar icons should be displayed or hidden","converters.pressure.mmhg":"pressure in milimeters of mercury (mm hg)","days.sunday":"the day of week","days.wed":"An abbreviation for Wednesday","features.winds":"the label that refers to the wind condition in a forecast.","converters.speed.ms":"meters per second","converters.distance.shrt.mm":"distance in milimeters","options.radar.custom":"label for option to display custom radar image","features.static":"name of the link that goes to a static radar page (one that is not animated)","menu.refresh":"link to refresh the weather data in Firefox context menu","options.remove":"label for the link to remove a location","options.data.pressure":"label for option to display pressure","options.rename":"label for the link to rename a location","options.units.precip.inches":"precipitation / distance option. inches (in)","features.visibility":"label that refers to visibility in the current conditions","days.sat":"An abbreviation for Saturday","features.action":"text-shrt is the weather description (e.g., Sunny). temperature is the temperature. location-name is the current selected location. example once rendered: Sunny, 70°F in New York","options.units.header":"header for units section of the options","features.day5":"name of link to the 5-day forecast","features.swa":"message that appears when a severe weather alert is active","options.locations.display_name":"the label for options to display the current location name in the toolbar","options.units.pressure.psi":"option for pressure (pounds per square inch)","features.options":"name of link to the options page","options.search.english":"An option asking if you want the names of the locations to be in English, or the native language for that location. For example, if you answer \"yes\" to this, Tokyo would be appear as Tokyo. if set to \"no\", Tokyo would be in Japanese (maybe this 東京)","menu.share":"link to share extension with friends in Firefox context menu","options.theme.more":"label for the link in the icons section for showing additional icon packs. (only 4 are shown initially. if you press this link, the rest are shown)","menu.improve":"link to a Forecastfox community page in Firefox context menu","notification.button.accesskey":"keyboard shortcut for the allow button. skip this if you're unsure what it does. (you can change it to a letter in the translation for 'allow')","options.locations.select":"label for button that selects a location","days.wednesday":"the day of week","options.units.wind.knots":"wind speed option. knots (nautical miles / hr)","options.search.accuerror":"error message that occurs when the location was found by google maps but can't be located on accuweather","options.units.custom":"label for a custom set of units","options.toolbar.labels":"question for the option to display the label (e.g., Now: 70°F) next to the image in the toolbar","options.units.precip.mm":"precipitation / distance option.millimeters (mm)","options.radar.none":"label for option to display no radar image","days.friday":"the day of week","features.details":"the name of the link that sends you to additional details for a particular forecast","features.hourly":"name of link to the hourly forecast page (hour-by-hour page)","features.forecast.high":"label for the high temperature on a day","options.no":"the label for all the\"no\" buttons in the options","days.monday":"the day of week","converters.temperature.f":"How to display a temperature in Fahrenheit? Ex: 4°F","features.forecast.toolbar":"short_day is the abbreviated name of the day example once rendered: Mon: 70°F","options.toolbar.daysornights":"label for option that specifies if you want to see days, nights or days and nights on the toolbar","converters.temperature.c":"How to display a temperature in Celsius? Ex: 4°C","options.units.metric":"label for metric units (°C, km/h, km)","menu.options":"the link to the options page in the Firefox context menu (right click menu)","options.toolbar.forecast":"how many days should appear in the toolbar?","features.moon":"label that refers to the moon phase","converters.temperature.k":"How to display a temperature in Kelvin (temperature)? Probably just copy this over to the right. Ex: 4K","options.radar.width":"label for custom radar image width textbox (px are pixels)","data.moon_phases.waxing_crescent":"A phase of the moon","days.saturday":"the day of week","days.fri":"An abbreviation for Friday","data.moon_phases.waning_gibbous":"A phase of the moon","menu.locations":"the switch locations submenu in the Firefox context menu","options.units.pressure.hpa":"option for pressure (hectopascal)","converters.speed.kph":"how to display kilometers per hour","options.saved":"message that appears when your settings are saved","options.units.visibility.km":"visibility / distance option. kilometers (km)","options.units.wind.kmh":"wind speed option. kilometers per hour (km/h)","converters.distance.lng.nm":"distance in nautical miles","options.search.button":"label for the location search button","options.units.pressure.header":"header for the pressure unit","options.units.wind.mph":"wind speed option. miles per hour (mph)","data.moon_phases.waxing_gibbous":"A phase of the moon","converters.distance.shrt.inches":"distance in inches","features.airquality":"label that refers to the air quality for a given day","options.positions.dragtip":"this is a help message that's displayed when you hover the '?' in the toolbar position section of the options. the msg explains how to use the drag and drop feature. a small screenshot will be inserted where the ${screenshot} variable appears","features.cc.toolbar":"short_day is the abbreviated name of the day example once rendered: Mon: 70°F","options.search.error":"error message for when an unknown error occurs when searching for your location","options.data.visibility":"label for option to display visibility","options.search.nolocs":"error message for when we can't find the person's location","options.restore.header":"header for the troubleshooting section of options","options.toolbar.radar":"label for option to display radar in toolbar","converters.time.h12.pm":"how to render a 12-hour PM time. ex: 5:30 PM","options.toolbar.text_image":"label for the option to display text label and the image","options.locations.header":"header for the locations section of options","options.toolbar.days":"label for option to show days on toolbar","features.cc.now":"refers to now in the sense of time (e.g., the label for current conditions)","options.units.temp.header":"header for the custom temperature unit","days.thursday":"the day of week","converters.pressure.psi":"pressure in pounds per squre inch","converters.time.h12.am":"how to render a 12-hour AM time. ex: 5:30 AM","options.restore.button":"button that reverts all of Forecastfox settings to default","options.data.precipitation":"label for option to display precipitaiton","options.instructions.top":"instructional message that appears at the top of the customization page","options.feedback":"the label for links to our feedback forums. this is used in the previous message in the ${feedback-forums} variable","options.locations.zoom":"link that appears in the bubbles on google maps. when clicked, it zooms the map to the selected location","days.thu":"An abbreviation for Thursday","converters.temperature.r":"How to display a temperature in Rankine (temperature)? Probably just copy this over to the right. Ex: 4 R","options.data.uv":"label for option to display ultraviolet radiation info (sun intensity)","days.mon":"An abbreviation for Monday","features.humidity":"label that refers to the humidity in the current conditions","features.uvindex":"label that refers to the ultraviolet index for a given day (intensity of the sun)","options.positions.statusbar":"the status bar is at the bottom of Firefox","options.units.precip.header":"header for precipitation unit","options.toolbar.hourly":"label for option to display link to hourly forecast in toolbar","days.tuesday":"the day of week","options.units.time.h12":"option for a 12 hour clock (AM/PM)","options.firefoxmigration":"this message is displayed the first time a Firefox user updates to the new version of Forecastfox (not on new installs). it apologies for requiring the user to search for their location again.","options.toolbar.cc":"label for option to display current conditions in toolbar","options.units.time.h24":"option for a 24 hour clock","converters.distance.shrt.cm":"distance in centimeters","options.positions.bookmarksbar":"the bookmarks bar is where you can store your bookmarks","options.yes":"the label for all the \"yes\" buttons in the options","menu.homepage":"link to Forecastfox website in Firefox context menu","options.units.visibility.m":"visibility / distance option. meters (m)","days.tue":"An abbreviation for Tuesday","options.title":"header for the options page","options.positions.header":"where should the toolbar appear within Firefox (statusbar? in the bookmarks bar?)","features.day15":"name of link to the 15-day forecast","options.radar.medium":"label for option to display medium radar image","features.forecast.tonight":"header for the tonight forecast. ex: Tonight","features.errors.connection":"this is an error message displayed when you can't connect to the feed","options.toolbar.swa":"label for option to display severe weather alerts in toolbar","options.units.pressure.mbar":"option for pressure (milibars)","converters.distance.lng.m":"distance in meters","options.toolbar.nights":"label for option to show nights on toolbar","options.save":"label for the link to save a renamed location","features.errors.connection_tooltip":"this is the tooltip for the connection error, displayed when you can't connect to the feed","options.radar.large":"label for option to display a large radar image","options.units.temp.k":"temperature option Kelvin (K)","data.moon_phases.last_quarter":"A phase of the moon","features.pressure":"label that refers to pressure in the current conditions","converters.time.h24":"how to render a 24-hour time. ex: 17:30","options.notranslate":"this message is displayed when a user selects a locale that AccuWeather does not have translations for. in this situation, the interface will be translated (the translation you're doing now) but the weather data will be in English. you can replace the 'this language' with your own language","data.moon_phases.waning_crescent":"A phase of the moon","features.precipitation":"label that refers to the precipitation on a given day","options.toolbar.day5":"label for option to display link to 5-day forecast in toolbar","options.locations.rotate":"the label for option to rotate locations. when enabled, this automatically switches locations every X minutes","options.restore.confirm":"confirmation for reverting all settings to default","options.data.moon":"label for option to display moon phases","options.toolbar.daysnights":"label for option to show days and nights on toolbar","features.forecast.night":"another header for the night forecast. you can use the same as above. sorry. ex: Tuesday Night","options.positions.menubar":"the menu bar is the bar at the top of Firefox, where the File menu is.","options.units.wind.header":"header for wind units","features.feelslike":"format for displaying the \"feels like\" temperature. ex: Feels like 70°F","options.data.humidity":"label for option to display humidity","converters.distance.lng.mi":"distance in miles","notification.message":"message that appears when NoScript has blocked the Forecastfox customization page","features.progress":"tooltip for the progress meter displayed when the weather data refreshes. keep ${location-name} in message","menu.accuweather":"link to AccuWeather website in Firefox context menu","converters.pressure.inhg":"how to display the pressure in inches (inches of mercury / in hg)","features.forecast.header":"the header for a night forecast. ex: Tuesday Night","features.forecast.tomorrownight":"header for tomorrow night's forecast. ex: Tomorrow Night","features.forecast.low":"label for the low temperature on a day","features.sunrise":"label that refers to a day's sunrise time"}